export default {
  name: "best-projects",
  components: {},
  props: [],
  data() {
    return {
      cards: [
        {
          projectTitle: "امنیت شبکه",
          img: "امنیت.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "تبلیغات",
          img: "تبلیغات.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "دیجیتال مارکتینگ",
          img: "مارکتینگ.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "طراحی اپلیکیشن",
          img: "اپلیکیشن.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "طراحی داخلی",
          img: "داخلی.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "طراحی هویت بصری",
          img: "بصری.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "طراحی وب سایت",
          img: "وبسایت.jpg",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        }
      ]
    };
  },
  computed: {},
  mounted() {},
  methods: {}
};
