export default {
  name: "best-projects",
  components: {},
  props: [],
  data() {
    return {
      cards: [
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        },
        {
          projectTitle: "موضوع پروژه",
          img: "70*70",
          projectDescription:
            "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده\n" +
            "از طراحان گرافیک است. چاپگرها و متون بل"
        }
      ]
    };
  },
  computed: {},
  mounted() {},
  methods: {}
};
